#!/usr/bin/env python3
#
# эта хрень генерирует пикчи типа смерть в нищите

from PIL import Image, ImageDraw, ImageFont

first = ["Смерть", "Богатство", "Долги", "Дипрессия", "Репрессии", "Эфтаназия",
         "Ностальгия", "Кайф", "Инсульт", "Инфаркт", "Аллергия", "Паралич",
         "Травма", "Банкротство", "Пиздец", "Кастрация", "Запой", "Изжога",
         "Баротравма", "Взлом жопы", "Оргазм", "Расстрел", "Нету сисек",
         "Доза", "Алкоголизм", "Оползень", "Фейл парковки", "Нене сдохла",
         "Канон мертва", "Боатинг", "Чекин", "ty письмо", "Отгул", "Снайп",
         "Бан", "Асмр", "Содержание", "Домагательства", "Педофилия", "Ран",
         "Беременость", "Дизбан", "Зависимость", "Робуксы", "Лечение",
         "Ломка", "Темка", "Кредит", "Судимость", "Тимворк", "Недосып"]

second = ["сталина", "жирной коровы", "тиринга", "огэ", "егэ", "сво", "гаи",
          "ркн", "секая", "мелинды", "кристал", "аскора", "валенка", "страннел",
          "oi oi", "саю", "rule34", "эвили", "падлы", "бадлы", "геев", "евреев",
          "беремености", "смерти", "кастрации", "фаер денса", "мельта",
          "креветки", "брбр патапима", "тимерс", "насвая", "мику", "кайто",
          "сеги", "геншина", "дон", "малоежки", "духоты", "крокодила",
          "доширака", "лечения рака", "1 egg", "долгов", "алиментов", "аниме",
          "кредитов", "шансика", "билдера", "мафиозо", "антию", "форсаки",
          "генераторов", "слешера", "ванити", "нацизма", "негров", "фашизма",
          "насилия", "менеджеров", "филеров", "ранеров", "питона", "рака",
          "гопников", "дэпа", "робуксов", "недосыпа", "бессонницы"]

font = ImageFont.truetype("./lobster.ttf", 54)

i = 0
for a in first:
    for b in second:
        i += 1
        img = Image.open("./template.png")
        y = img.height/1.9
        draw = ImageDraw.Draw(img)
        text = a + " " + "от" + " " + b
        text_length = draw.textlength(text, font)
        x = (img.width - text_length)/2
        draw.text((x, y), text, font=font)
        img.save(f"./images/{i}.webp", "webp", optimize = True, quality = 0.01)

with open("max", "w") as f:
    f.write(str(i))
